TomaszKozminski/STM32-ToF-Matrix-Display/Core/Src/main.c
  /* USER CODE END USART2_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
  /* DMA2_Channel6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Channel6_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA2_Channel6_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, B2_Pin|R2_Pin|B1_Pin|R1_Pin
                          |A_Pin|C_Pin|OE_Pin|G2_Pin
                          |G1_Pin|B_Pin|D_Pin|LAT_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(I2C_PWREN_GPIO_Port, I2C_PWREN_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(I2C_LPN_GPIO_Port, I2C_LPN_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(I2C_RST_GPIO_Port, I2C_RST_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : B2_Pin R2_Pin B1_Pin R1_Pin
                           A_Pin C_Pin OE_Pin G2_Pin
                           G1_Pin B_Pin D_Pin LAT_Pin */
  GPIO_InitStruct.Pin = B2_Pin|R2_Pin|B1_Pin|R1_Pin
                          |A_Pin|C_Pin|OE_Pin|G2_Pin
                          |G1_Pin|B_Pin|D_Pin|LAT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : I2C_PWREN_Pin */
  GPIO_InitStruct.Pin = I2C_PWREN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(I2C_PWREN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : BUTTON_Pin */
  GPIO_InitStruct.Pin = BUTTON_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BUTTON_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : I2C_LPN_Pin I2C_RST_Pin */
  GPIO_InitStruct.Pin = I2C_LPN_Pin|I2C_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : I2C_INT_Pin */
  GPIO_InitStruct.Pin = I2C_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(I2C_INT_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI1_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI1_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void LoopTask(void const * argument)
{
  for(;;){
    LedMatrix_DisplayFrame();
    osDelay(1);
  }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */

  // TOF sersor's variables
  RangeSensor mySensor; 
  ObjectTracker myTracker;
  RangeSensorFrame currentFrame;

  ObjectTrackerConfig tracker_cfg = {
      .min_dist_mm     = 50.0f,
      .max_dist_mm     = 2000.0f,
      .fade_dist_mm    = 300.0f,
      .min_mass_detect = 3.5f,
      .smooth_factor   = 0.15f,
      .sensor_fov_deg  = 45.0f  // Standardowe FOV dla VL53L7CX (45x45)
  };


  // Image's variables
  Canvas mainCanvas;
  Frame outputFrame;
  ImageBackground mainBG;
  ImageMovingItem mainItem;

  MoveRange moveLimts = {
    .maxOffsetX = ItemOffsets[imageIndex][0],
    .maxOffsetY = ItemOffsets[imageIndex][1]
  };

  PositionDataRange inputRange = {
    .minX = 0.0,
    .maxX = 7.0,
    .minY = 0.0,
    .maxY = 7.0
  };

  Image mainImage = {
    .Background = &mainBG,
    .MovingItem = &mainItem
  };


  // TOF init
  VL53L7CX_Adapter_Construct(&mySensor, &hi2c2, 0x52);
  
  if (RangeSensor_Init(&mySensor) != RS_OK){
    Error_Handler();
  }
      
  ObjectTracker_Init(&myTracker, &tracker_cfg);

  if (RangeSensor_Start(&mySensor) != RS_OK) {
    Error_Handler();
  }

  // Init Canvas and Image
  if(Canvas_Create(&mainCanvas)){
    Error_Handler();
  }
  ImageBackground_Init(&mainBG, BackgroundLibrary[imageIndex], WHITE);
  ImageMovingItem_Init(&mainItem, MovingItemLibrary[imageIndex], moveLimts, inputRange, RED);  

  // task loop
  for(;;)
  {
      // read sensor
      RangeSensor_Status status = RangeSensor_GetFrame(&mySensor, &currentFrame);

      if (status == RS_OK) {
          // calculate sensor read
          ObjectTracker_Process(&myTracker, &currentFrame);

          // if button pressed load new image
          if(changeImage){
            changeImage = false;
            ImageBackground_SetNewBackgroundData(&mainBG, BackgroundLibrary[imageIndex % LIB_IMAGES_CNT]);
            ImageMovingItem_SetNewItemData(&mainItem, MovingItemLibrary[imageIndex % LIB_IMAGES_CNT]);
          }
          
          // set image accordingly to sensor read
          ImageMovingItem_SetPosition(&mainItem, ObjectTracker_GetX(&myTracker), ObjectTracker_GetY(&myTracker));
          // put image on canvas
          Canvas_PutImage(&mainCanvas, &mainImage);

          // generate output frame
          outputFrame = Canvas_GenerateFrame(&mainCanvas);          
          // send frame to display
          LedMatrix_ChangeFrame(outputFrame);
      }
      else if (status == RS_ERROR_HW_FAILURE) {
          Error_Handler();
      }
  }
  /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
  // FPS cnt tim3
  if(htim->Instance == TIM3){
    FPS = 0;
  }
  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
    osDelay(1000); 
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
